[
  {
    "id":1,
    "number":"1",
    "content":"Kształtuje własną osobowość zgodnie z Prawem Harcerskim, w tym ułożył i konsekwentnie realizował plan swojego rozwoju.",
    "rankId":1,
    "taskIds":[ ]
  },
  {
    "id":2,
    "number":"2",
    "content":"Pogłębia swoją wiedzę i rozwija swoje zainteresowania.",
    "rankId":1,
    "taskIds":[ ]
  },
  {
    "id":3,
    "number":"3",
    "content":"Zachowuje właściwe proporcje w wypełnianiu obowiązków wynikających z przynależności do różnych grup społecznych (rodzina, szkoła, drużyna, środowisko zawodowe).",
    "rankId":1,
    "taskIds":[ ]
  },
  {
    "id":4,
    "number":"4",
    "content":"Podejmuje stałą służbę w swoim harcerskim środowisku.",
    "rankId":1,
    "taskIds":[ ]
  },
  {
    "id":5,
    "number":"5",
    "content":"Bierze udział w życiu hufca.",
    "rankId":1,
    "taskIds":[ ]
  },
  {
    "id":6,
    "number":"6",
    "content":"W trakcie minimum 9-miesięcznej aktywnej służby w gromadzie/drużynie wykazał się umiejętnością pracy wychowawczej metodą harcerską z dziećmi lub młodzieżą w wybranej grupie wiekowej,",
    "rankId":1,
    "taskIds":[ ]
  },
  {
    "id":7,
    "number":"6.1",
    "content":"w tym umiejętnościami: stosowania instrumentów metodycznych,",
    "rankId":1,
    "taskIds":[ ]
  },
  {
    "id":8,
    "number":"6.2",
    "content":"w tym umiejętnościami: stosowania systemu małych grup,",
    "rankId":1,
    "taskIds":[ ]
  },
  {
    "id":9,
    "number":"6.3",
    "content":"w tym umiejętnościami: tworzenia programu gromady/drużyny, jego realizacji i podsumowania,",
    "rankId":1,
    "taskIds":[ ]
  },
  {
    "id":10,
    "number":"6.4",
    "content":"w tym umiejętnościami: pracy z Prawem i Przyrzeczeniem / Prawem i Obietnicą,",
    "rankId":1,
    "taskIds":[ ]
  },
  {
    "id":11,
    "number":"6.5",
    "content":"w tym umiejętnościami: samodzielnego prowadzenia zbiórek",
    "rankId":1,
    "taskIds":[ ]
  },
  {
    "id":12,
    "number":"6.6",
    "content":"oraz uczestniczył w: organizacji wyjazdowych form pracy wykorzystujących kontakt z przyrodą,",
    "rankId":1,
    "taskIds":[ ]
  },
  {
    "id":13,
    "number":"6.7",
    "content":"oraz uczestniczył w: organizowaniu oraz przeprowadzeniu gier i form pracy w terenie uwzględniających współdziałanie i współzawodnictwo,",
    "rankId":1,
    "taskIds":[ ]
  },
  {
    "id":14,
    "number":"6.8",
    "content":"oraz uczestniczył w: pozyskiwaniu środków finansowych lub innych form wsparcia działalności gromady/drużyny,",
    "rankId":1,
    "taskIds":[ ]
  },
  {
    "id":15,
    "number":"6.9",
    "content":"oraz uczestniczył w: organizacji obozu (kolonii) lub zimowiska drużyny/gromady i pełnił na nim funkcję,",
    "rankId":1,
    "taskIds":[ ]
  },
  {
    "id":16,
    "number":"6.10",
    "content":"oraz uczestniczył w: prowadzeniu dokumentacji niezbędnej do działania gromady/drużyny,",
    "rankId":1,
    "taskIds":[ ]
  },
  {
    "id":17,
    "number":"6.11",
    "content":"oraz uczestniczył w: współpracy ze środowiskiem działania – rodzicami, szkołą itp.",
    "rankId":1,
    "taskIds":[ ]
  },
  {
    "id":18,
    "number":"7",
    "content":"Wykazał się umiejętnością stosowania zasad dotyczących umundurowania, musztry, ceremoniału harcerskiego w pracy z drużyną.",
    "rankId":1,
    "taskIds":[ ]
  },
  {
    "id":19,
    "number":"8",
    "content":"Wiedzę zdobytą w harcerskiej literaturze i mediach wykorzystał w pracy wychowawczej. Przeczytał minimum 3 książki harcerskie.",
    "rankId":1,
    "taskIds":[ ]
  },
  {
    "id":20,
    "number":"1",
    "content":"Wykazał się umiejętnością pracy nad sobą, stawiania celów w życiu, podejmowania działań (do ich realizacji), ich oceny i wyciągania wniosków.",
    "rankId":2,
    "taskIds":[ ]
  },
  {
    "id":21,
    "number":"2",
    "content":"Podnosi swoje umiejętności i kwalifikacje.",
    "rankId":2,
    "taskIds":[ ]
  },
  {
    "id":22,
    "number":"3",
    "content":"Bierze czynny udział w życiu otaczającego go środowiska społecznego.",
    "rankId":2,
    "taskIds":[ ]
  },
  {
    "id":23,
    "number":"4",
    "content":"W swojej pracy instruktorskiej świadomie wykorzystuje służbę.",
    "rankId":2,
    "taskIds":[ ]
  },
  {
    "id":24,
    "number":"5",
    "content":"Wykazał się umiejętnością pracy w zespole, komunikowania się oraz motywowania innych. Zrealizował zadanie instruktorskie na poziomie szczepu lub hufca.",
    "rankId":2,
    "taskIds":[ ]
  },
  {
    "id":25,
    "number":"6",
    "content":"Pogłębił znajomość harcerskiego systemu wychowawczego oraz zasad metodyki grup wiekowych.",
    "rankId":2,
    "taskIds":[ ]
  },
  {
    "id":26,
    "number":"7",
    "content":"Stosuje metodę harcerską w pracy z instruktorami.",
    "rankId":2,
    "taskIds":[ ]
  },
  {
    "id":27,
    "number":"8",
    "content":"Świadomie stosuje System pracy z kadrą.",
    "rankId":2,
    "taskIds":[ ]
  },
  {
    "id":28,
    "number":"9",
    "content":"Pracuje nad swoją postawą instruktorską. Doskonali swoje umiejętności harcerskie i instruktorskie – w trakcie próby brał udział w minimum 2 wybranych formach kształceniowych.",
    "rankId":2,
    "taskIds":[ ]
  },
  {
    "id":29,
    "number":"10",
    "content":"Przygotował się do roli opiekuna próby na stopnie instruktorskie.",
    "rankId":2,
    "taskIds":[ ]
  },
  {
    "id":30,
    "number":"11",
    "content":"Pozyskał sojuszników do działalności harcerskiej.",
    "rankId":2,
    "taskIds":[ ]
  },
  {
    "id":31,
    "number":"12",
    "content":"Pełnił funkcję instruktorską w czasie roku harcerskiego i był członkiem komendy kolonii/obozu lub zimowiska.",
    "rankId":2,
    "taskIds":[ ]
  },
  {
    "id":32,
    "number":"13",
    "content":"Orientuje się w historii i aktualnej sytuacji harcerstwa. Korzysta z harcerskiej literatury i mediów. Przeczytał minimum 3 wybrane książki harcerskie.",
    "rankId":2,
    "taskIds":[ ]
  },
  {
    "id":33,
    "number":"14",
    "content":"Wykazał się znajomością przepisów finansowych i organizacyjnych oraz zasad prowadzenia obozu harcerskiego odpowiadających wymaganiom stawianym kierownikom wypoczynku.",
    "rankId":2,
    "taskIds":[ ]
  },
  {
    "id":34,
    "number":"15",
    "content":"Wykazał się umiejętnością pozyskiwania środków na działalność harcerską.",
    "rankId":2,
    "taskIds":[ ]
  },
  {
    "id":35,
    "number":"1",
    "content":"W świadomy sposób określa i realizuje własne plany życiowe.",
    "rankId":3,
    "taskIds":[ ]
  },
  {
    "id":36,
    "number":"2",
    "content":"Pogłębia swoją wiedzę zawodową.",
    "rankId":3,
    "taskIds":[ ]
  },
  {
    "id":37,
    "number":"3",
    "content":"Poza swoimi zainteresowaniami zawodowymi poznaje wybraną dziedzinę nauki lub kultury.",
    "rankId":3,
    "taskIds":[ ]
  },
  {
    "id":38,
    "number":"4",
    "content":"Świadomie stosuje harcerski system wychowawczy, upowszechnia go i dzieli się własnymi doświadczeniami.",
    "rankId":3,
    "taskIds":[ ]
  },
  {
    "id":39,
    "number":"5",
    "content":"Przygotował się do roli opiekuna próby na stopień podharcmistrza i harcmistrza.",
    "rankId":3,
    "taskIds":[ ]
  },
  {
    "id":40,
    "number":"6",
    "content":"Kierował zespołem instruktorskim. W jego działaniu kształtował postawy oraz poszerzał wiedzę i umiejętności instruktorów.",
    "rankId":3,
    "taskIds":[ ]
  },
  {
    "id":41,
    "number":"7",
    "content":"Wykazał się skutecznym stosowaniem Systemu pracy z kadrą w kierowanym przez siebie zespole instruktorskim.",
    "rankId":3,
    "taskIds":[ ]
  },
  {
    "id":42,
    "number":"8",
    "content":"Zrealizował zadanie instruktorskie na poziomie chorągwi lub Związku.",
    "rankId":3,
    "taskIds":[ ]
  },
  {
    "id":43,
    "number":"9",
    "content":"Opracował i upowszechnił materiały programowo-metodyczne jako wkład w dorobek Związku.",
    "rankId":3,
    "taskIds":[ ]
  },
  {
    "id":44,
    "number":"10",
    "content":"W trakcie próby ukończył kurs harcmistrzowski lub aktywnie uczestniczył w minimum 2 innych formach wymiany doświadczeń poziomu harcmistrzowskiego (kursy, warsztaty, seminaria, konferencje itp.).",
    "rankId":3,
    "taskIds":[ ]
  },
  {
    "id":45,
    "number":"Zadania oparte na idei stopni - 1",
    "content":"Harcerz/harcerka zrealizuje przynajmniej dwa zadania oparte na idei stopnia oraz symbolice  płomieni wędrowniczej watry wspierające jego/jej holistyczny rozwój.",
    "rankId":4,
    "taskIds":[ ]
  },
  {
    "id":45,
    "number":"Zadania oparte na idei stopnia - 2",
    "content":"Harcerz/harcerka zrealizuje przynajmniej dwa zadania oparte na idei stopnia oraz symbolice  płomieni wędrowniczej watry wspierające jego/jej holistyczny rozwój.",
    "rankId":4,
    "taskIds":[ ]
  },
  {
    "id":46,
    "number":"W trakcie próby - 1",
    "content":"Wziąłem/Wzięłam udział w przygotowaniu obozu/zimowiska: planowaniu preliminarza, przygotowaniu sprzętu, organizacji transportu oraz zaplanowaniu zakupów żywieniowych.",
    "rankId":4,
    "taskIds":[ ]
  },
  {
    "id":47,
    "number":"W trakcie próby - 2",
    "content":"Przeszedłem/Przeszłam co najmniej 15-godzinne szkolenie z zakresu pierwszej pomocy i wykorzystałem/am zdobyte umiejętności do pełnienia służby na rzecz własnego środowiska lub na zewnątrz organizacji.",
    "rankId":4,
    "taskIds":[ ]
  },
  {
    "id":48,
    "number":"W trakcie próby - 3",
    "content":"Przygotowałem/am się i odbyłem/am wędrówkę o charakterze wyczynu.",
    "rankId":4,
    "taskIds":[ ]
  },
  {
    "id":49,
    "number":"Sprawności/odznaki/uprawnienia",
    "content":"Harcerz/harcerka zdobędzie jedną sprawność czterogwiazdkową (****). Zamiast sprawności czterogwiazdkowej harcerz/harcerka może w ramach próby zdobyć odznakę biegłości według odrębnego regulaminu lub odznakę/uprawnienie zewnętrzne.",
    "rankId":4,
    "taskIds":[ ]
  },
  {
    "id":50,
    "number":"Służba",
    "content":"Harcerz/harcerka zrealizuje co najmniej jedno zadanie zorientowane na pełnienie służby wynikającej z idei stopnia. Do tego celu można wykorzystać instrument metodyczny – tropy.",
    "rankId":4,
    "taskIds":[ ]
  },
  {
    "id":51,
    "number":"Rozwój społeczny - 1",
    "content":"Harcerz/harcerka zrealizuje co najmniej jedno zadanie zorientowane na pielęgnowanie więzi rodzinnych w zakresie wynikającym z idei stopnia. Można wykorzystać odpowiednie sprawności lub wyzwania.",
    "rankId":4,
    "taskIds":[ ]
  },
  {
    "id":52,
    "number":"Rozwój społeczny - 2",
    "content":"W trakcie próby harcerka/harcerz działa w grupie rówieśniczej (np. patrolu, zastępie, drużynie wędrowniczej lub grupie rówieśniczej poza ZHP). Można ułożyć zadania opisujące funkcjonowanie harcerza/harcerki w zastępie i wykorzystać instrument metodyczny – tropy.",
    "rankId":4,
    "taskIds":[ ]
  },
  {
    "id":53,
    "number":"Rozwój duchowy i emocjonalny",
    "content":"Harcerz/harcerka zrealizuje co najmniej jedno zadanie skupione na osiągnięciu poziomu wyznaczonego ideą stopnia w oparciu o Prawo Harcerskie. Można wykorzystać instrument metodyczny – wyzwania.",
    "rankId":4,
    "taskIds":[ ]
  },
  {
    "id":54,
    "number":"Zadania uzupełniające",
    "content":"W próbie mogą znaleźć się zadania uzupełniające niezbędne do osiągnięcia poziomu opisanego ideą stopnia. Łączna liczba zadań uzupełniających nie może przekroczyć trzech. Realizacja żadnego z nich nie może trwać dłużej niż miesiąc. W środowiskach mogą obowiązywać stałe zadania uzupełniające dotyczące bohatera lub tradycji środowiska.",
    "rankId":4,
    "taskIds":[ ]
  },
  {
    "id":55,
    "number":"Zadania oparte na idei stopnia",
    "content":"Harcerz/harcerka zrealizuje co najmniej jedno zadanie oparte na idei stopnia oraz symbolice  wędrowniczej watry wspierające jego/jej holistyczny rozwój.",
    "rankId":5,
    "taskIds":[ ]
  },
  {
    "id":56,
    "number":"Zadania mistrzowskie",
    "content":"Harcerz/harcerka zrealizuje co najmniej jedno zadanie mistrzowskie związane z rozwojem  zawodowym (np. zdobycie odznaki wyszkolenia specjalnościowego, certyfikatu, odznak  i uprawnień państwowych, ukończenie kursu).",
    "rankId":5,
    "taskIds":[ ]
  },
  {
    "id":57,
    "number":"Zadania polegające na zainicjowaniu służby",
    "content":"Harcerz/harcerka zrealizuje co najmniej jedno zadanie polegające na zainicjowaniu służby  wybranej na podstawie analizy potrzeb społecznych w najbliższym otoczeniu harcerza/harcerki  i pełnieniu jej przez okres próby (może być służba indywidualna - np. SWA, działania  indywidualne bądź jako koordynator grupy – np. lider tropu wędrowniczego).",
    "rankId":5,
    "taskIds":[ ]
  },
  {
    "id":58,
    "number":"Rozwój duchowy i emocjonalny",
    "content":"Harcerz/harcerka zrealizuje co najmniej jedno zadanie skupione na osiągnięciu poziomu  wyznaczonego ideą stopnia w oparciu o Prawo harcerskie. Można do tego celu wykorzystać  instrument metodyczny – wyzwania.",
    "rankId":5,
    "taskIds":[ ]
  }
  
]